label character_room_first:

    scene character_room with dissolve

    play music "sounds/music/house.mp3"

    "Ох... Всё это таки сон!"

    "Но звонкий голос той незнакомки до сих пор стоял у меня в ушах."

    "Сколько бы раз мне не снился тот лес, она ни разу там не появлялась до сегодняшней ночи."

    "Может, это и правда был не сон?!"

    #здесь нужен звук телефонного звонка
    "..."

    "Настойчивый телефонный звонок вернул меня в реальность."

    "Рита..."

    rita "Хей, соня, проснулся?!"

    me "Да, да, вот только что."

    rita "Ты время видел?!"

    "Я посмотрел на настенные часы, и меня будто током ударило. Почти одиннадцать утра!!!"

    me "Эм.. Я..."

    rita "Быстро дуй на вокзал, поезд отходит через полтора часа!!!"

    "Я бросил трубку и в ужасе начал собираться."

    "А пока собирался, все думал, в какую же передрягу попал."

    "Скоро должна была состояться свадьба, которую я очень не хотел."

    "Я должен был жениться на женщине, которую старался избегать."

    "Дурак..."

    "Нырнуть в это с головой, и всё ради чего? Ради карьеры! Отец Риты - мой начальник - пророчил мне солидную должность."

    "Заместитель генерального директора!"

    "Огромная зарплата, связи, уважение, деньги! Я бы смог бросить эту душную бабушкину квартиру и переехать куда-нибудь за город, поближе к лесу!"

    "Всего то нужно было согласиться на брак с Ритой, которая, кажется, относилась ко всему, как к развлечению."

    "В ней не было ни глубины, ни души, ни интереса. Ничего. Пустой человек, плывущий по течению."

    "Боже..."

    "Но отступать было поздно. Через полтора часа я должен был сесть на поезд в Москву, где нужно было вопрос с рестораном - там мы планировали отпраздновать свадьбу."

    "Ресторан был настолько пафосный, что на него засматривался каждый второй олигарх."

    "И если не договориться сегодня, следующего раза не будет."

    "..."

    "Может, оно и к лучшему?"

    show BunnyQueenUnknown with dissolve

    play music "sounds/music/embarrassing.mp3"

    bunny_queen_unknown "Ихихихи, не сомнвайся, езжай себе!"

    me "ЧТО?!! ТЫ?!! КАК?!!"

    hide BunnyQueenUnknown with dissolve

    "Что это было?!"

    "С этими вопросами и свадьбой я уже начинаю грезить наяву!"

    "Пф, лучше пойти на вокзал, пока не поздно!"

    stop music

    jump train_present

    return