label dream_first:

    scene dream_forest with dissolve

    play music "sounds/music/dream.mp3"

    "Каждую ночь мне снится один и тот же лес."

    "Яркое солнце, пение птиц, звонкое дуновение ветра."

    "Не очень похоже на моё Купчино."

    "Самое странное, что я осознаю свой сон. Как у Кастанеды."

    "Могу ходить, прыгать, петь. Словом всё, что могу делать в реальности."

    "Может, я наконец-то умер и попал в рай?"

    "Хотя, какой ещё рай? Я же не верю в Бога, да и вообще всю религию считаю сказкой для наивных бабушек."

    "И всё таки, такое яркое небо, такой чистый воздух."

    bunny_queen_unknown "Нет, глупенький, ты не умер!"

    "Кто это?! Я оглядываюсь, и не вижу никого вокруг."

    me "Кто ты? Где ты?!"

    show BunnyQueenUnknown with dissolve

    bunny_queen_unknown "Ихихи, ну чего ты кричишь?!"

    "Она возникла передо мной прямо из воздуха, как привидение из детских страшилок."

    "Девушка, на вид двадцать лет, с милым личиком и зайчьими ушами."

    me "Ты кто!?"

    bunny_queen_unknown "Хихих, разве это так важно!?"

    me "Ну вообще-то ты в моем сне!"

    bunny_queen_unknown "Ихихих, что? Ты думаешь, что это сон?"

    me "Эм, а что это?"

    bunny_queen_unknown "Начнем с того, что люди ещё не научились осознавать свои сны."

    "Я расстерялся..."

    me "И где же я?"

    bunny_queen_unknown "У меня дома. Добро пожаловать, ихихи!"

    "Она смеялась, как маленькая девочка. Я понял, что ничего толкового от неё не добьюсь."

    me "..."

    bunny_queen_unknown "Ну ладно, ладно, чего дуешься то?"

    bunny_queen_unknown "Я просто проверяла тебя."

    me "Зачем? И почему меня?"

    bunny_queen_unknown "Не важно. Но тебе повезло: ты проверку прошел."

    bunny_queen_unknown "Я вижу, что твоя душа чиста, невинна, а помыслы благородны."

    bunny_queen_unknown "Попробуем с тобой поработать!"

    "С каждым её словом вопросы в моей голове копились, как снежный ком."

    "Дошло до того, что я так и не смог придумать что спросить первым."

    bunny_queen_unknown "Жу-жу-жу-жу, будильник!!!"

    "Что?!!"

    hide BunnyQueenUnknown with dissolve

    "..."

    jump character_room_first

    return