label empire_city:

    scene empire_city with dissolve

    "Оказавшись в городе, я обомлел..."

    "На секунду меня озарила уверенность, что все происходящее - не спектакль и не мероприятие."

    "Какой бы богатой не была мэрия Москва, и то бы ей не хватило всех денег, чтобы так сильно изменить улицу."

    "Старинные дома имперского типа благоухали свежестью, яркий свет полуденного солнца отражался от их чистых окон."

    "По тротуарам сновали те же люди, что и на вокзале. Те же фраки, те же изящные платья, те же аккуратно скроенные шиннели, те же грязные сарафаны крестьян..."

    "По дорогам вместо привычных мне инномарок, вроде BMW или Renault, сновали кареты, запряженные лошадьми."

    "Ни светофоров, ни самокатов, ни велосипедов... Никаких признаков современной цивилизации."

    "Даже вместо привычных 'Вкусно и точка' или 'FixPrice' на фасадах домов красовались какие-то балакейные лавки с вывесками вроде 'Пассажъ' или 'Аптекарскiй Складъ'."

    "Это сон... Я по прежнему сплю..."

    "Но нет, я вполне осознавал реальность происходящего. Хоть бей себя по руке, хоть прыгай, хоть танцуй - не могут сны быть такими яркими..."

    "... Стоп!..."

    "Я просто устал с дороги, вот и всё! Сейчас найду метро, сяду в него и поеду в центр! К красной площади!"

    "Только так я уверую, что это всё это реально мероприятие!"

    "Или есть другой способ!"

    "Ну конечно! Гугл!"

    "Я полез в карман за смартфоном, и..."

    "..."

    "Большими усилиями я подавил в себе желание плюхнуться на асфальт от безысходности и непонимания."

    "Где мои джинсы?! Где мой пиджак, который купила мне Рита за пятьдесят тысяч рублей? Где моя рубашка?! Где туфли?!!"

    "Что за хрень на мне?!!!"

    "Я бросился к ближайшей витрине."

    scene igor_scary with dissolve

    "..."

    "В отражении появился юноша, подозрительно похожий на меня."

    "Те же непослушные черные волосы, те же очки аля 'Гарри Поттер', тот же длинный нос, которым почему-то гордилась моя бабушка..."

    "Но это был не я! Точно не я!"

    "Я бы никогда в жизни не стал носить кадетскую форму..."

    "Нет-нет... Это тот кондуктор! Он перенес меня в другой вагон, переодел, украл мои вещи и был таков!"

    "Сволочь!"

    scene igor_scary with dissolve

    show conductor with dissolve

    "А вот и он!"

    conductor "Хм... почему вы так смотрите на меня, Сударь?"

    me "Ты ещё спрашиваешь?! Зачем вы меня оглушили и перенесли в другой поезд?! Где мои вещи?! Я сейчас полицию вызову!"

    "Кондуктор уставился на меня так, будто я наставил на него пистолет..."

    "Впрочем, привычное недовольство быстро к нему вернулось."

    conductor "Кхм, сударь, я право не знаю о чем вы говорите!"

    conductor "И как вы смеете мне угрожать?! Я сейчас сам городового позову!"

    "Он говорил так искренне, что я расстерялся. На секунду даже потерял ход мыслей."

    me "Но... кто тогда меня обокрал?!"

    conductor "Сударь, никто вас не обкрадывал. Вас сюда принесли в таком виде."

    me "Что?! Принес?! Кто принес?!"

    conductor "Она! Она вас сюда и принесла!"

    hide conductor with dissolve

    "И ушел..."

    "Я было бросился за ним, но он успел затеряться в толпе."

    "О чем это он?! Что значит Она?!"

    "Она... Она!"

    "Зайчиха!"

    "Или та девушка-краб?!"

    "Но почему... За что..."

    return