label train_present:

    scene train

    play music "sounds/sound/train_sound.mp3"

    "Фух, едва успел..."

    "Полтора часа - и я буду в Москве!"

    "Зато у меня будет достаточно времени чтобы почитать 'Потерянный Рай' Милтона."

    "Люблю старинную поэзию! Хоть ненадолго отвлекусь от всей этой свадебной суэты."

    show CrabQueen with dissolve

    play music "sounds/music/embarrassing.mp3"

    unknown_crab_girl "Крххх, тебя не должно здесь быть!!"

    me "ЧТО??!!!!"

    "Что происходит?! Почему прямо передо мной из воздуха материализовалось нечто, похожее одновременно на женщину и на краба?!"

    "Я оглянулся вокруг и к своему ужасу заметил, что кроме меня никто не обращает на неё внимания."

    "Может, это косплеерша? Тогда почему у неё такой угрожающий вид, как будет она хочется меня расчленить, а потом сожрать."

    "Я всё ещё сплю... Все ещё сплю!!!"

    me "АЙ!!"

    "Что-что, а клешни у неё были тяжелыми, как молоты."

    unknown_crab_girl "Крххх, убедился, что я реальна?! А теперь немедленно выбирайся из этого поезда, пока я тебе нос не отрезала!"

    menu:
        "Кто вы такая?! Что вам нужно?!":
            
            unknown_crab_girl "Крххх, с чего это должна тебе представляться? Ты не достоин познать мою личность!"

        "Вы мне угрожаете?":
            
            unknown_crab_girl "Крххх, мелкий червяк, на тебя даже воздух сотрясать жалко."

    unknown_crab_girl "Крххх, даю тебе минуту, чтобы ты в спешке покинул поезд!"

    menu:
        "Вы как-то связаны с моими снами?!":

            unknown_crab_girl "Крххх, не знаю ни о каких снах! Ты разве не понял, что я реальна?!"

        "Вы знаете девушку с зайчьими ушами?":

            unknown_crab_girl "Крххх, она приходила к тебе?! Ничтожество! Вы оба!"

    unknown_crab_girl "Крххх, последний шанс, убирайся из поезда, пока..."

    hide CrabQueen with dissolve

    "Исчезла!!"

    bunny_queen_unknown "Ихихи!"

    bunny_queen_unknown "Не беспокойся! Ты в безопасности!"

    me "Что? Где вы? Я не понимаю..."

    bunny_queen_unknown "Ихихи, не надо ничего понимать. Просто спиииии..."

    "Неожиданно на меня накатила дурнота. Веки отяжелили, сопротивляться "

    return